# --- shell & prompt ---
brew "fish"
brew "starship"

# --- runtime manager ---
brew "mise"           # node/go/java — replaces node@18, openjdk, go formulae

# --- modern unix replacements ---
brew "eza"            # replaces exa (unmaintained)
brew "bat"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "xh"             # replaces httpie (faster, Rust, compatible syntax)
brew "doggo"          # replaces dog (unmaintained)

# --- git & signing ---
brew "git"
brew "gh"
brew "bfg"            # git history cleanup

# --- editors & tools ---
brew "micro"
brew "pv"
brew "tree"
brew "mas"            # App Store CLI

# --- network / infra diagnostics ---
brew "mtr"
brew "nmap"
brew "iperf3"

# --- infra / k8s ---
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kubectx"        # provides kubectx + kubens
brew "stern"          # multi-pod log tailing
brew "ansible"        # configuration management / automation
brew "ansible-lint"   # Ansible linter (work requirement)
brew "asimov"         # exclude node_modules/.git from Time Machine

# --- dev tooling ---
brew "hadolint"       # Dockerfile linter
brew "yamllint"
brew "jsonlint"
brew "jq"
brew "yq"
brew "fzf"
brew "zoxide"
brew "lazygit"
brew "dive"           # Docker image layer analysis
brew "sqlite"
brew "mmctl"          # Mattermost CLI
brew "atuin"          # shell history with fuzzy search and sync
brew "maven"          # Java build tool (mise manages JVM runtime)

# --- security ---
brew "openssl@3"

# --- fonts ---
cask "font-martian-mono"
cask "font-sauce-code-pro-nerd-font"

# --- terminal & editors ---
cask "kitty"
cask "visual-studio-code"

# --- infra GUI ---
cask "headlamp"       # CNCF k8s GUI, replaces Lens
cask "dbeaver-community"

# --- tunneling ---
cask "cloudflared"    # replaces ngrok

# --- Yandex Cloud ---
cask "yandex-cloud-cli"

# --- productivity ---
cask "obsidian"

# --- communication ---
cask "telegram"

# --- media ---
cask "spotify"
cask "vlc"

# --- security / privacy ---
brew "bitwarden-cli"  # CLI для secrets management (bw-ssh, bw-env)
cask "cryptomator"

# --- IoT / infra ---
cask "mqtt-explorer"

# --- hardware / hobby ---
cask "arduino-ide"
cask "betaflight-configurator"
cask "raspberry-pi-imager"
cask "android-platform-tools"

# --- crypto ---
# cask "ledger-wallet"

# --- App Store ---
mas "Bitwarden",    id: 1352778147   # primary — prefer over cask above
mas "Mattermost",   id: 1614666244
mas "Windows App",  id: 1295203466   # Microsoft Remote Desktop
mas "Tomato One",   id: 907364780

# --- VS Code extensions (installed by `brew bundle`; needs `code` on PATH) ---
# AI
vscode "anthropic.claude-code"
# Git
vscode "eamodio.gitlens"
# Languages
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "svelte.svelte-vscode"
# Infrastructure / DevOps
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "hashicorp.hcl"
vscode "docker.docker"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
# Formatters / Linters
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "stylelint.vscode-stylelint"
vscode "davidanson.vscode-markdownlint"
# Data formats
vscode "tamasfe.even-better-toml"
vscode "csstools.postcss"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "xyz.plsql-language"
vscode "mariusschulz.yarn-lock-syntax"
vscode "webben.browserslist"
# Editor UX
vscode "editorconfig.editorconfig"
vscode "mikestead.dotenv"
vscode "kshetline.ligatures-limited"
vscode "ms-vscode.live-server"
# Markdown
vscode "yzhang.markdown-all-in-one"
# Spell check
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
# Theme / Icons
vscode "rafaelmardojai.vscode-gnome-theme"
vscode "pkief.material-icon-theme"
# Localisation
vscode "ms-ceintl.vscode-language-pack-ru"
